Revit 2027 API
BuiltInFailures.RebarSystemFailures.DPartReinforcementDeleted Property
 Reinforcement hosted on highlighted Parts will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DPartReinforcementDeleted { get; }
Public Shared ReadOnly Property DPartReinforcementDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DPartReinforcementDeleted {
	FailureDefinitionId^ get ();
}
static member DPartReinforcementDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace